<template>
    <div class="relative flex justify-center items-center bg-[#E7F0FC] min-h-[100vh] pb-24">
        <section id="main"
            class="md:px-[222px] md:py-[62px] w-[90vw] md:w-[80vw] mt-10 bg-[#fafafa] relative z-50 rounded-2xl min-h-[60vh] md:min-h-[80vh] flex flex-col justify-center items-center"
            style="box-shadow: 4px 6px 20px 0px rgba(26, 60, 84, 0.4)">
            <svg class="mx-auto" xmlns="http://www.w3.org/2000/svg" width="120" height="120" viewBox="0 0 120 120"
                fill="none">
                <g clip-path="url(#clip0_27_1766)">
                    <path
                        d="M60 0C26.9161 0 0 26.9161 0 60C0 93.0839 26.9161 120 60 120C93.0839 120 120 93.0839 120 60C120 26.9161 93.0839 0 60 0ZM60 106.307C34.4669 106.307 13.6931 85.534 13.6931 60C13.6931 34.466 34.4669 13.6931 60 13.6931C85.5331 13.6931 106.306 34.466 106.306 60C106.306 85.534 85.5331 106.307 60 106.307Z"
                        fill="#69BC45" />
                    <path
                        d="M82.5068 36.4316C77.8134 40.8367 73.4978 45.6172 69.1417 50.3495C64.9648 54.8865 60.5377 59.2088 56.7378 64.0798C55.5357 65.6209 54.2685 67.8518 52.1103 68.0851C50.4112 68.2575 47.8827 63.8279 46.9359 62.7323C45.0643 60.5656 43.3009 55.3396 39.4579 55.7944C38.681 55.8866 37.7511 56.223 36.5769 56.8511C34.3773 58.0279 27.7607 59.798 28.1901 63.1431C28.4632 65.2692 31.4321 66.5431 32.7128 67.8247C36.0849 71.1968 39.4579 74.5681 42.83 77.9394C45.0364 80.1458 46.5699 83.1645 49.1296 85.0176C52.3335 87.3364 54.3159 84.6185 56.5231 82.3581C58.4514 80.3833 60.2985 78.3291 62.2504 76.3772C66.0798 72.5485 69.9101 68.7199 73.7396 64.8905C77.329 61.3011 80.882 57.672 84.8797 54.5171C87.8757 52.1526 91.979 49.2776 91.8218 44.5977C91.7372 42.0853 90.5639 38.6219 88.9966 36.2295C86.4284 32.3113 84.3869 34.6648 82.5043 36.4316H82.5068Z"
                        fill="#69BC45" />
                </g>
                <defs>
                    <clipPath id="clip0_27_1766">
                        <rect width="120" height="120" fill="white" />
                    </clipPath>
                </defs>
            </svg>
            <h2 class="text-[40px] md:text-6xl text-center text-primary my-[14px]">ขอบคุณ <br /><span
                    class="text-origin">สำหรับคำสั่งซื้อ!</span></h2>
            <p class="text-detail mb-5 text-center">ระบบได้รับอีเมลจากคุณแล้ว <br />ทางเราจะติดต่อกลับไปให้เร็วที่สุด!</p>
            <router-link :to="{ name: 'Home' }" class="text-origin">กลับสู่หน้าแรก</router-link>
        </section>
    </div>
</template>
<script>
export default {

}
</script>
<style lang="">

</style>